% Καθαρισμός Παραθύρου Εντολών και μεταβλητών
clear; clc;

% Πίνακας τιμών συνάρτησης f δύο ανεξάρτητων μεταβλητών
X = [1, 1.1, 1.2, 1.3, 1.4];
Y = [2, 2.2, 2.4, 2.6, 2.8];
V = [5.3069, 5.4115, 5.5245, 5.6445, 5.7704;
     6.2515, 6.3762, 6.5092, 6.6492, 6.7951;
     7.2845, 7.4292, 7.5822, 7.7422, 7.9081;
     8.4045, 8.5692, 8.7422, 8.9221, 9.1080;
     9.6104, 9.7951, 9.9881, 10.1880, 10.3939];

% Συντεταγμένες σημείου ενδιαφέροντος (Xq,Yq)
Xq=1.13;
Yq=2.44;

% Τιμή της συνάρτησης στο σημείο ενδιαφέροντος Vq μέσω 
% της μεθόδου διπλής γραμμικής παρεμβολής
Vq = interp2(X,Y,V,Xq,Yq)

% Ακριβή τιμή της fq μέσω του τύπου της
f = @(x,y) x*y+y^2-log(x*y);
fq = f(Xq,Yq)

% Σχετικό σφάλμα της παρεμβολής
sf = abs(f(Xq,Yq)-Vq)*100/f(Xq,Yq)
