%Η συνάρτηση rf_bisection, που ακολουθεί, έχει παραμέτρους
%  fs = ένα string με τη συνάρτηση
%  a = την αρχή του διαστήματος αναζήτησης της ρίζας
%  b = το τέλος του διαστήματος αναζήτησης της ρίζας
%  s = την επιθυμητή ακρίβεια
%Ενώ οι έξοδοι της είναι
%  root = η ρίζα που βρέθηκε
%  res = ένα string που μας πληροφορεί αν όλα πήγαν καλά και βρέθηκε σωστά η ρίζα ή αν κάτι δεν πήγε καλά.

% Καθαρισμός του παραθύου εντολών καθώς και τυχόντων τιμών αποθηκευμένων
% στις μεταβλητές μας από προηγούμενη εκτέλεση του προγράμματος.
clear all; clc;

% Εισαγωγή των άκρων του διαστήματος a b, του πλήθους των σημείων για την
% γραφική n, της ακρίβειας s και της συνάρτησης f.
a=2;
b=4;
n=50;
s=0.0005;
fs='4*x*sin(x)-x^2*exp(-x)';
[root,res,f]=rf_bisection(fs,a,b,s)


% Τα αρακάτω θα εμφανιστούν στο παράθυρο εντολών για να βεβαιωθούμε ότι το
% πρόγραμμα τρέχει καθώς και το αποτέλεσμα της ρίζας.

disp('************************************************')
disp('***          S T A R T I N G    R U N        ***')
root
disp('************************************************')

% Εντολές για την κατασκευή της γραφικής από το x=-2 ως το x=4 και των αξόνων.
x=linspace(-2,5,n);
figure(1);
plot(x,f(x),'LineWidth',2);
title('bisection')
xlabel('x')
ylabel('f(x)')
