% Συνάρτηση που εκτελεί την αριθμητική παραγώγιση, με ορίσματα f την
% επιλεκτέα συνάρτηση, x το σημείο παραγώγιση και h την αρχική ακρίβεια.
function[df]=der(x,h,f)
df = (f(x+h)-f(x-h))/(2*h);
h = h/2;
while true % βρόχος που επαναλαμβάνεται μέχρι την επιθυμητή ακρίβεια
    df_new = (f(x+h)-f(x-h))/(2*h);
    if abs(df_new - df) < 1e-4 % ακρίβεια 4 δεκαδικών ψηφίων
        break;
    end
    df = df_new;
    h = h/2; % υποδιπλασιασμός του h σε κάθε επανάληψη
end
disp(['Η προσέγγιση της παραγώγου της συνάρτησης είναι']);
df