% Καθαρισμός του Παραθύρου Εντολών και των μεταβλητών
clc; clear;

% Επίλογη συνάρτησης
%f = @(x) cos(x);
f = @(x) x^2-x-1;

% x το σημείο που βρίσκουμε την παράγωγο, h την αρχική ακρίβεια, df η
% προσεγγιστική τιμή της παραγώγου
%x = pi/6;
x = (1+sqrt(5))/2;
h = 0.2;

% Κάλεσμα της συνάρτησης που θα εκτελέσει την αριθμητική παραγώγιση
df = der(x,h,f);

% Εύρεση της ακριβής τιμής της παραγώγου
disp(['Η ακριβής τιμή της παραγώγου της συνάρτησης είναι']);
%f0 = -sin(pi/6)
f0 = 2*((1+sqrt(5))/2)-1

% Υπολογισμός της απόκλισης
disp('Η επί τοις εκατό απόκλισή τους είναι');
sf = 100*abs((df-f0)/f0)