% Η συνάρτηση df_RK4, που ακολουθεί, έχει παραμέτρους
%  dy1, dy2 = οι διαφορικές εξισώσεις
%  x0 = την αρχική τιμή του x
%  xt = την τελική τιμή του x (τιμή τέλους ολοκλήρωσης)
%  y01, y02 = οι αρχικές τιμές των y1, y2, y01 = y1(x0), y02 = y2(x0)
%  h = το βήμα ολοκλήρωσης 
% Οι έξοδοι της 
%  xr = ο πίνακας με τις τιμές του x
%  yr1, yr2 = οι πίνακες με τις αντίστοιχες τιμές των y1, y2

function[xr,yr1,yr2] = df_RK4(dy1,dy2,x0,xt,y01,y02,h)
 dy1 = vectorize(inline(dy1,'x','y1','y2'));
 dy2 = vectorize(inline(dy2,'x','y1','y2'));

 i = 1;
 xr(1) = x0;
 yr1(1) = y01;
 yr2(1) = y02;
% Αρχικές συνθήκες
 x = x0;
 y1 = y01;
 y2 = y02;

 while ((xt-x)/h>0) 
 % Υπολογισμός συντελεστών k
  k11 = dy1(x,y1,y2); % y1
  k12 = dy2(x,y1,y2); % y2

  k21 = dy1(x+h/2,y1+h/2*k11,y2+h/2*k11); 
  k22 = dy2(x+h/2,y1+h/2*k12,y2+h/2*k12);
 
  k31 = dy1(x+h/2,y1+h/2*k21,y2+h/2*k21); 
  k32 = dy2(x+h/2,y1+h/2*k22,y2+h/2*k22); 
 
  k41 = dy1(x+h,y1+h*k31,y2+h*k31); 
  k42 = dy2(x+h,y1+h*k32,y2+h*k32);
 % Υπολογισμός yr1, yr2
  y1 = y1+(k11+2*k21+2*k31+k41)/6*h;
  y2 = y2+(k12+2*k22+2*k32+k42)/6*h;
  x = x+h;
  i = i+1;
  xr(i) = x;
  yr1(i) = y1;
  yr2(i) = y2;
 end
end
